README.org
#+SEQ_TODO: OPTIONAL
* Steps needed to get a working addon
** change addon.xml
change the addon id and name and anything else you need to suit your addon
** change the jen folder name
change it to reflect the addon id you assigned in step 1. not really needed while developing, but important before doing the first release so you don't overwrite any other addons using Jen
** fill out variables
fill out these lines in default.py
#+BEGIN_SRC python
root_xml_url = "http://"  # url of the root xml file
__builtin__.tvdb_api_key = ""  # tvdb api key
__builtin__.tmdb_api_key = ""  # tmdb api key
__builtin__.trakt_client_id = ""  # trakt client id
__builtin__.trakt_client_secret = ""  # trakt client secret
#+END_SRC
** OPTIONAL if your xmls don't end in xml change resources/lib/util/xml.py
change the following code in __init__
#+BEGIN_SRC python
  if url.endswith(".xml"):
      request = urllib2.Request(replace_url(url))
      response = urllib2.urlopen(request)
      xml = response.read()
      response.close()
  else:
      xml = url
#+END_SRC
to
#+BEGIN_SRC python
  request = urllib2.Request(replace_url(url))
  response = urllib2.urlopen(request)
  xml = response.read()
  response.close()
#+END_SRC
** OPTIONAL change the replace_url function in resources/lib/util/url.py
add any url replacing functions here. this shouldn't usualy be necesary
* XML Formats for Jen
** Main Directories
#+BEGIN_EXAMPLE
  <dir>
          <name></name>
          <link></link>
          <animated_thumbnail></animated_thumbnail>
          <thumbnail></thumbnail>
          <animated_fanart></animated_fanart>
          <fanart></fanart>
  </dir>
#+END_EXAMPLE
** Movies
#+BEGIN_EXAMPLE
  <item>
          <title></title>
          <meta>
                  <content>movie</content>
                  <imdb></imdb>
                  <title></title>
                  <year></year>
          </meta>
          <link>
                  <sublink>search</sublink>
                  <sublink>searchsd</sublink>
          </link>
          <animated_thumbnail></animated_thumbnail>
          <thumbnail></thumbnail>
          <animated_fanart></animated_fanart>
          <fanart></fanart>
  </item>
#+END_EXAMPLE
** TV Directories
#+BEGIN_EXAMPLE
  <dir>
          <title></title>
          <meta>
                  <content>tvshow</content>
                  <imdb></imdb>
                  <tvdb></tvdb>
                  <tvshowtitle></tvshowtitle>
                  <year></year>
          </meta>
          <link></link>
          <animated_thumbnail></animated_thumbnail>
          <thumbnail></thumbnail>
          <animated_fanart></animated_fanart>
          <fanart></fanart>
  </dir>
#+END_EXAMPLE
** TV Seasons
#+BEGIN_EXAMPLE
  <dir>
          <name></name>
          <meta>
                  <content>season</content>
                  <imdb></imdb>
                  <tvdb></tvdb>
                  <tvshowtitle></tvshowtitle>
                  <year></year>
                  <season></season>
          </meta>
          <link></link>
          <animated_thumbnail></animated_thumbnail>
          <thumbnail></thumbnail>
          <animated_fanart></animated_fanart>
          <fanart></fanart>
  </dir>
#+END_EXAMPLE
** TV Episodes
#+BEGIN_EXAMPLE
  <item>
          <title></title>
          <meta>
                  <content>episode</content>
                  <imdb></imdb>
                  <tvdb></tvdb>
                  <tvshowtitle></tvshowtitle>
                  <year></year>
                  <title></title>
                  <premiered></premiered>
                  <season></season>
                  <episode></episode>
          </meta>
          <link>
                  <sublink>search</sublink>
                  <sublink>searchsd</sublink>
          </link>
          <animated_thumbnail></animated_thumbnail>
          <thumbnail></thumbnail>
          <animated_fanart></animated_fanart>
          <fanart></fanart>
  </item>
#+END_EXAMPLE
** Youtube Channels
#+BEGIN_EXAMPLE
  <plugin>
    <title></title>
    <link>plugin://plugin.video.youtube/channel/***CHANNEL NUMBER HERE***/playlists/</link>
    <animated_thumbnail></animated_thumbnail>
    <thumbnail></thumbnail>
    <animated_fanart></animated_fanart>
    <fanart></fanart>
  </plugin>
#+END_EXAMPLE
