README.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2017-08-16 Wed 20:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Steps needed to get a working addon</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> change addon.xml</h3>
<div class="outline-text-3" id="text-1-1">
<p>
change the addon id and name and anything else you need to suit your addon
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> change the jen folder name</h3>
<div class="outline-text-3" id="text-1-2">
<p>
change it to reflect the addon id you assigned in step 1. not really needed while developing, but important before doing the first release so you don't overwrite any other addons using Jen
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> fill out variables</h3>
<div class="outline-text-3" id="text-1-3">
<p>
fill out these lines in default.py
</p>
<div class="org-src-container">

<pre class="src src-python">root_xml_url = "http://"  # url of the root xml file
__builtin__.tvdb_api_key = ""  # tvdb api key
__builtin__.tmdb_api_key = ""  # tmdb api key
__builtin__.trakt_client_id = ""  # trakt client id
__builtin__.trakt_client_secret = ""  # trakt client secret
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="label label-default OPTIONAL">OPTIONAL</span> if your xmls don't end in xml change resources/lib/util/xml.py</h3>
<div class="outline-text-3" id="text-1-4">
<p>
change the following code in <span class="underline"><span class="underline">init</span></span>
</p>
<div class="org-src-container">

<pre class="src src-python">if url.endswith(".xml"):
    request = urllib2.Request(replace_url(url))
    response = urllib2.urlopen(request)
    xml = response.read()
    response.close()
else:
    xml = url
</pre>
</div>
<p>
to
</p>
<div class="org-src-container">

<pre class="src src-python">request = urllib2.Request(replace_url(url))
response = urllib2.urlopen(request)
xml = response.read()
response.close()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="label label-default OPTIONAL">OPTIONAL</span> change the replace<sub>url</sub> function in resources/lib/util/url.py</h3>
<div class="outline-text-3" id="text-1-5">
<p>
add any url replacing functions here. this shouldn't usualy be necesary
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> XML Formats for Jen</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Main Directories</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
&lt;dir&gt;
        &lt;name&gt;&lt;/name&gt;
        &lt;link&gt;&lt;/link&gt;
        &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
        &lt;thumbnail&gt;&lt;/thumbnail&gt;
        &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
        &lt;fanart&gt;&lt;/fanart&gt;
&lt;/dir&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Movies</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
&lt;item&gt;
        &lt;title&gt;&lt;/title&gt;
        &lt;meta&gt;
                &lt;content&gt;movie&lt;/content&gt;
                &lt;imdb&gt;&lt;/imdb&gt;
                &lt;title&gt;&lt;/title&gt;
                &lt;year&gt;&lt;/year&gt;
        &lt;/meta&gt;
        &lt;link&gt;
                &lt;sublink&gt;search&lt;/sublink&gt;
                &lt;sublink&gt;searchsd&lt;/sublink&gt;
        &lt;/link&gt;
        &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
        &lt;thumbnail&gt;&lt;/thumbnail&gt;
        &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
        &lt;fanart&gt;&lt;/fanart&gt;
&lt;/item&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> TV Directories</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
&lt;dir&gt;
        &lt;title&gt;&lt;/title&gt;
        &lt;meta&gt;
                &lt;content&gt;tvshow&lt;/content&gt;
                &lt;imdb&gt;&lt;/imdb&gt;
                &lt;tvdb&gt;&lt;/tvdb&gt;
                &lt;tvshowtitle&gt;&lt;/tvshowtitle&gt;
                &lt;year&gt;&lt;/year&gt;
        &lt;/meta&gt;
        &lt;link&gt;&lt;/link&gt;
        &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
        &lt;thumbnail&gt;&lt;/thumbnail&gt;
        &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
        &lt;fanart&gt;&lt;/fanart&gt;
&lt;/dir&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> TV Seasons</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
&lt;dir&gt;
        &lt;name&gt;&lt;/name&gt;
        &lt;meta&gt;
                &lt;content&gt;season&lt;/content&gt;
                &lt;imdb&gt;&lt;/imdb&gt;
                &lt;tvdb&gt;&lt;/tvdb&gt;
                &lt;tvshowtitle&gt;&lt;/tvshowtitle&gt;
                &lt;year&gt;&lt;/year&gt;
                &lt;season&gt;&lt;/season&gt;
        &lt;/meta&gt;
        &lt;link&gt;&lt;/link&gt;
        &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
        &lt;thumbnail&gt;&lt;/thumbnail&gt;
        &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
        &lt;fanart&gt;&lt;/fanart&gt;
&lt;/dir&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> TV Episodes</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
&lt;item&gt;
        &lt;title&gt;&lt;/title&gt;
        &lt;meta&gt;
                &lt;content&gt;episode&lt;/content&gt;
                &lt;imdb&gt;&lt;/imdb&gt;
                &lt;tvdb&gt;&lt;/tvdb&gt;
                &lt;tvshowtitle&gt;&lt;/tvshowtitle&gt;
                &lt;year&gt;&lt;/year&gt;
                &lt;title&gt;&lt;/title&gt;
                &lt;premiered&gt;&lt;/premiered&gt;
                &lt;season&gt;&lt;/season&gt;
                &lt;episode&gt;&lt;/episode&gt;
        &lt;/meta&gt;
        &lt;link&gt;
                &lt;sublink&gt;search&lt;/sublink&gt;
                &lt;sublink&gt;searchsd&lt;/sublink&gt;
        &lt;/link&gt;
        &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
        &lt;thumbnail&gt;&lt;/thumbnail&gt;
        &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
        &lt;fanart&gt;&lt;/fanart&gt;
&lt;/item&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Youtube Channels</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example">
&lt;plugin&gt;
  &lt;title&gt;&lt;/title&gt;
  &lt;link&gt;plugin://plugin.video.youtube/channel/***CHANNEL NUMBER HERE***/playlists/&lt;/link&gt;
  &lt;animated_thumbnail&gt;&lt;/animated_thumbnail&gt;
  &lt;thumbnail&gt;&lt;/thumbnail&gt;
  &lt;animated_fanart&gt;&lt;/animated_fanart&gt;
  &lt;fanart&gt;&lt;/fanart&gt;
&lt;/plugin&gt;
</pre>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Steps needed to get a working addon</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. change addon.xml</a></li>
<li><a href="#sec-1-2">1.2. change the jen folder name</a></li>
<li><a href="#sec-1-3">1.3. fill out variables</a></li>
<li><a href="#sec-1-4">1.4. if your xmls don't end in xml change resources/lib/util/xml.py</a></li>
<li><a href="#sec-1-5">1.5. change the replace<sub>url</sub> function in resources/lib/util/url.py</a></li>
</ul>
</li>
<li><a href="#sec-2">2. XML Formats for Jen</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Main Directories</a></li>
<li><a href="#sec-2-2">2.2. Movies</a></li>
<li><a href="#sec-2-3">2.3. TV Directories</a></li>
<li><a href="#sec-2-4">2.4. TV Seasons</a></li>
<li><a href="#sec-2-5">2.5. TV Episodes</a></li>
<li><a href="#sec-2-6">2.6. Youtube Channels</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2017-08-16 Wed 20:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org-mode</a> 9.0.9)</p>
</div>
</footer>
</body>
</html>
